using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Ets.Model.Common.AliPay
{
    public class AlipayNotifyData
    {
        /// <summary>
        /// 合作者身份ID
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string partner { set; get; }

        /// <summary>
        /// 二维码
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string qrcode { set; get; }

        /// <summary>
        /// 商品名称
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string subject { set; get; }

        /// <summary>
        /// 支付宝交易号
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string trade_no { set; get; }

        /// <summary>
        /// 商户网站唯一订单号
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string out_trade_no { set; get; }

        /// <summary>
        /// 交易总金额
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string total_fee { set; get; }

        /// <summary>
        /// 交易状态
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string trade_status { set; get; }

        /// <summary>
        /// 买家支付宝账号
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string buyer_email { set; get; }

        /// <summary>
        /// 交易创建时间
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string gmt_create { set; get; }

        /// <summary>
        /// 交易付款时间
        /// </summary>
        /// 创建者：宋渊博
        /// 创建日期：2015/3/26 11:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string gmt_payment { set; get; }
    }
}
